MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA169/mcu.h
extern volatile __USBE2CSR2bits_t USBE2CSR2bits __asm__ ("USBE2CSR2") __attribute__((section("sfrs"), address(0xBF8E3128)));
#define USBE2CSR3 USBE2CSR3
extern volatile uint32_t   USBE2CSR3 __attribute__((section("sfrs"), address(0xBF8E312C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE2CSR3bits_t;
extern volatile __USBE2CSR3bits_t USBE2CSR3bits __asm__ ("USBE2CSR3") __attribute__((section("sfrs"), address(0xBF8E312C)));
#define USBE3CSR0 USBE3CSR0
extern volatile uint32_t   USBE3CSR0 __attribute__((section("sfrs"), address(0xBF8E3130)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE3CSR0bits_t;
extern volatile __USBE3CSR0bits_t USBE3CSR0bits __asm__ ("USBE3CSR0") __attribute__((section("sfrs"), address(0xBF8E3130)));
#define USBE3CSR1 USBE3CSR1
extern volatile uint32_t   USBE3CSR1 __attribute__((section("sfrs"), address(0xBF8E3134)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE3CSR1bits_t;
extern volatile __USBE3CSR1bits_t USBE3CSR1bits __asm__ ("USBE3CSR1") __attribute__((section("sfrs"), address(0xBF8E3134)));
#define USBE3CSR2 USBE3CSR2
extern volatile uint32_t   USBE3CSR2 __attribute__((section("sfrs"), address(0xBF8E3138)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE3CSR2bits_t;
extern volatile __USBE3CSR2bits_t USBE3CSR2bits __asm__ ("USBE3CSR2") __attribute__((section("sfrs"), address(0xBF8E3138)));
#define USBE3CSR3 USBE3CSR3
extern volatile uint32_t   USBE3CSR3 __attribute__((section("sfrs"), address(0xBF8E313C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE3CSR3bits_t;
extern volatile __USBE3CSR3bits_t USBE3CSR3bits __asm__ ("USBE3CSR3") __attribute__((section("sfrs"), address(0xBF8E313C)));
#define USBE4CSR0 USBE4CSR0
extern volatile uint32_t   USBE4CSR0 __attribute__((section("sfrs"), address(0xBF8E3140)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE4CSR0bits_t;
extern volatile __USBE4CSR0bits_t USBE4CSR0bits __asm__ ("USBE4CSR0") __attribute__((section("sfrs"), address(0xBF8E3140)));
#define USBE4CSR1 USBE4CSR1
extern volatile uint32_t   USBE4CSR1 __attribute__((section("sfrs"), address(0xBF8E3144)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE4CSR1bits_t;
extern volatile __USBE4CSR1bits_t USBE4CSR1bits __asm__ ("USBE4CSR1") __attribute__((section("sfrs"), address(0xBF8E3144)));
#define USBE4CSR2 USBE4CSR2
extern volatile uint32_t   USBE4CSR2 __attribute__((section("sfrs"), address(0xBF8E3148)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE4CSR2bits_t;
extern volatile __USBE4CSR2bits_t USBE4CSR2bits __asm__ ("USBE4CSR2") __attribute__((section("sfrs"), address(0xBF8E3148)));
#define USBE4CSR3 USBE4CSR3
extern volatile uint32_t   USBE4CSR3 __attribute__((section("sfrs"), address(0xBF8E314C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE4CSR3bits_t;
extern volatile __USBE4CSR3bits_t USBE4CSR3bits __asm__ ("USBE4CSR3") __attribute__((section("sfrs"), address(0xBF8E314C)));
#define USBE5CSR0 USBE5CSR0
extern volatile uint32_t   USBE5CSR0 __attribute__((section("sfrs"), address(0xBF8E3150)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE5CSR0bits_t;
extern volatile __USBE5CSR0bits_t USBE5CSR0bits __asm__ ("USBE5CSR0") __attribute__((section("sfrs"), address(0xBF8E3150)));
#define USBE5CSR1 USBE5CSR1
extern volatile uint32_t   USBE5CSR1 __attribute__((section("sfrs"), address(0xBF8E3154)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE5CSR1bits_t;
