MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA169/mcu.h
#define _DSGPR14_DSGPR_POSITION                  0x00000000
#define _DSGPR14_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR14_DSGPR_LENGTH                    0x00000020

#define _DSGPR15_DSGPR_POSITION                  0x00000000
#define _DSGPR15_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR15_DSGPR_LENGTH                    0x00000020

#define _DSGPR16_DSGPR_POSITION                  0x00000000
#define _DSGPR16_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR16_DSGPR_LENGTH                    0x00000020

#define _DSGPR17_DSGPR_POSITION                  0x00000000
#define _DSGPR17_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR17_DSGPR_LENGTH                    0x00000020

#define _DSGPR18_DSGPR_POSITION                  0x00000000
#define _DSGPR18_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR18_DSGPR_LENGTH                    0x00000020

#define _DSGPR19_DSGPR_POSITION                  0x00000000
#define _DSGPR19_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR19_DSGPR_LENGTH                    0x00000020

#define _DSGPR20_DSGPR_POSITION                  0x00000000
#define _DSGPR20_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR20_DSGPR_LENGTH                    0x00000020

#define _DSGPR21_DSGPR_POSITION                  0x00000000
#define _DSGPR21_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR21_DSGPR_LENGTH                    0x00000020

#define _DSGPR22_DSGPR_POSITION                  0x00000000
#define _DSGPR22_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR22_DSGPR_LENGTH                    0x00000020

#define _DSGPR23_DSGPR_POSITION                  0x00000000
#define _DSGPR23_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR23_DSGPR_LENGTH                    0x00000020

#define _DSGPR24_DSGPR_POSITION                  0x00000000
#define _DSGPR24_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR24_DSGPR_LENGTH                    0x00000020

#define _DSGPR25_DSGPR_POSITION                  0x00000000
#define _DSGPR25_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR25_DSGPR_LENGTH                    0x00000020

#define _DSGPR26_DSGPR_POSITION                  0x00000000
#define _DSGPR26_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR26_DSGPR_LENGTH                    0x00000020

#define _DSGPR27_DSGPR_POSITION                  0x00000000
#define _DSGPR27_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR27_DSGPR_LENGTH                    0x00000020

#define _DSGPR28_DSGPR_POSITION                  0x00000000
#define _DSGPR28_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR28_DSGPR_LENGTH                    0x00000020

#define _DSGPR29_DSGPR_POSITION                  0x00000000
#define _DSGPR29_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR29_DSGPR_LENGTH                    0x00000020

#define _DSGPR30_DSGPR_POSITION                  0x00000000
#define _DSGPR30_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR30_DSGPR_LENGTH                    0x00000020

#define _DSGPR31_DSGPR_POSITION                  0x00000000
#define _DSGPR31_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR31_DSGPR_LENGTH                    0x00000020

#define _DSGPR32_DSGPR_POSITION                  0x00000000
#define _DSGPR32_DSGPR_MASK                      0xFFFFFFFF
#define _DSGPR32_DSGPR_LENGTH                    0x00000020

#define _PRECON_PFMWS_POSITION                   0x00000000
#define _PRECON_PFMWS_MASK                       0x00000007
#define _PRECON_PFMWS_LENGTH                     0x00000003

#define _PRECON_PREFEN_POSITION                  0x00000004
#define _PRECON_PREFEN_MASK                      0x00000030
#define _PRECON_PREFEN_LENGTH                    0x00000002

#define _PRECON_PFMSECEN_POSITION                0x0000001A
#define _PRECON_PFMSECEN_MASK                    0x04000000
#define _PRECON_PFMSECEN_LENGTH                  0x00000001

#define _PRESTAT_PFMSECCNT_POSITION              0x00000000
#define _PRESTAT_PFMSECCNT_MASK                  0x000000FF
#define _PRESTAT_PFMSECCNT_LENGTH                0x00000008

#define _PRESTAT_PFMSEC_POSITION                 0x0000001A
#define _PRESTAT_PFMSEC_MASK                     0x04000000
#define _PRESTAT_PFMSEC_LENGTH                   0x00000001

#define _PRESTAT_PFMDED_POSITION                 0x0000001B
#define _PRESTAT_PFMDED_MASK                     0x08000000
#define _PRESTAT_PFMDED_LENGTH                   0x00000001

#define _EBICS0_CSADDR_POSITION                  0x00000010
#define _EBICS0_CSADDR_MASK                      0xFFFF0000
#define _EBICS0_CSADDR_LENGTH                    0x00000010

#define _EBICS1_CSADDR_POSITION                  0x00000010
#define _EBICS1_CSADDR_MASK                      0xFFFF0000
#define _EBICS1_CSADDR_LENGTH                    0x00000010

#define _EBICS2_CSADDR_POSITION                  0x00000010
#define _EBICS2_CSADDR_MASK                      0xFFFF0000
#define _EBICS2_CSADDR_LENGTH                    0x00000010

#define _EBICS3_CSADDR_POSITION                  0x00000010
#define _EBICS3_CSADDR_MASK                      0xFFFF0000
#define _EBICS3_CSADDR_LENGTH                    0x00000010

#define _EBIMSK0_MEMSIZE_POSITION                0x00000000
#define _EBIMSK0_MEMSIZE_MASK                    0x0000001F
#define _EBIMSK0_MEMSIZE_LENGTH                  0x00000005

#define _EBIMSK0_MEMTYPE_POSITION                0x00000005
#define _EBIMSK0_MEMTYPE_MASK                    0x000000E0
#define _EBIMSK0_MEMTYPE_LENGTH                  0x00000003

#define _EBIMSK0_REGSEL_POSITION                 0x00000008
#define _EBIMSK0_REGSEL_MASK                     0x00000700
#define _EBIMSK0_REGSEL_LENGTH                   0x00000003

#define _EBIMSK1_MEMSIZE_POSITION                0x00000000
#define _EBIMSK1_MEMSIZE_MASK                    0x0000001F
#define _EBIMSK1_MEMSIZE_LENGTH                  0x00000005

#define _EBIMSK1_MEMTYPE_POSITION                0x00000005
#define _EBIMSK1_MEMTYPE_MASK                    0x000000E0
#define _EBIMSK1_MEMTYPE_LENGTH                  0x00000003

#define _EBIMSK1_REGSEL_POSITION                 0x00000008
#define _EBIMSK1_REGSEL_MASK                     0x00000700
#define _EBIMSK1_REGSEL_LENGTH                   0x00000003

#define _EBIMSK2_MEMSIZE_POSITION                0x00000000
#define _EBIMSK2_MEMSIZE_MASK                    0x0000001F
#define _EBIMSK2_MEMSIZE_LENGTH                  0x00000005

#define _EBIMSK2_MEMTYPE_POSITION                0x00000005
#define _EBIMSK2_MEMTYPE_MASK                    0x000000E0
#define _EBIMSK2_MEMTYPE_LENGTH                  0x00000003

#define _EBIMSK2_REGSEL_POSITION                 0x00000008
#define _EBIMSK2_REGSEL_MASK                     0x00000700
#define _EBIMSK2_REGSEL_LENGTH                   0x00000003

