MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA169/mcu.h
#define _GLCDCLUT111_RED_POSITION                0x00000010
#define _GLCDCLUT111_RED_MASK                    0x00FF0000
#define _GLCDCLUT111_RED_LENGTH                  0x00000008

#define _GLCDCLUT112_BLUE_POSITION               0x00000000
#define _GLCDCLUT112_BLUE_MASK                   0x000000FF
#define _GLCDCLUT112_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT112_GREEN_POSITION              0x00000008
#define _GLCDCLUT112_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT112_GREEN_LENGTH                0x00000008

#define _GLCDCLUT112_RED_POSITION                0x00000010
#define _GLCDCLUT112_RED_MASK                    0x00FF0000
#define _GLCDCLUT112_RED_LENGTH                  0x00000008

#define _GLCDCLUT113_BLUE_POSITION               0x00000000
#define _GLCDCLUT113_BLUE_MASK                   0x000000FF
#define _GLCDCLUT113_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT113_GREEN_POSITION              0x00000008
#define _GLCDCLUT113_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT113_GREEN_LENGTH                0x00000008

#define _GLCDCLUT113_RED_POSITION                0x00000010
#define _GLCDCLUT113_RED_MASK                    0x00FF0000
#define _GLCDCLUT113_RED_LENGTH                  0x00000008

#define _GLCDCLUT114_BLUE_POSITION               0x00000000
#define _GLCDCLUT114_BLUE_MASK                   0x000000FF
#define _GLCDCLUT114_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT114_GREEN_POSITION              0x00000008
#define _GLCDCLUT114_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT114_GREEN_LENGTH                0x00000008

#define _GLCDCLUT114_RED_POSITION                0x00000010
#define _GLCDCLUT114_RED_MASK                    0x00FF0000
#define _GLCDCLUT114_RED_LENGTH                  0x00000008

#define _GLCDCLUT115_BLUE_POSITION               0x00000000
#define _GLCDCLUT115_BLUE_MASK                   0x000000FF
#define _GLCDCLUT115_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT115_GREEN_POSITION              0x00000008
#define _GLCDCLUT115_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT115_GREEN_LENGTH                0x00000008

#define _GLCDCLUT115_RED_POSITION                0x00000010
#define _GLCDCLUT115_RED_MASK                    0x00FF0000
#define _GLCDCLUT115_RED_LENGTH                  0x00000008

#define _GLCDCLUT116_BLUE_POSITION               0x00000000
#define _GLCDCLUT116_BLUE_MASK                   0x000000FF
#define _GLCDCLUT116_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT116_GREEN_POSITION              0x00000008
#define _GLCDCLUT116_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT116_GREEN_LENGTH                0x00000008

#define _GLCDCLUT116_RED_POSITION                0x00000010
#define _GLCDCLUT116_RED_MASK                    0x00FF0000
#define _GLCDCLUT116_RED_LENGTH                  0x00000008

#define _GLCDCLUT117_BLUE_POSITION               0x00000000
#define _GLCDCLUT117_BLUE_MASK                   0x000000FF
#define _GLCDCLUT117_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT117_GREEN_POSITION              0x00000008
#define _GLCDCLUT117_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT117_GREEN_LENGTH                0x00000008

#define _GLCDCLUT117_RED_POSITION                0x00000010
#define _GLCDCLUT117_RED_MASK                    0x00FF0000
#define _GLCDCLUT117_RED_LENGTH                  0x00000008

#define _GLCDCLUT118_BLUE_POSITION               0x00000000
#define _GLCDCLUT118_BLUE_MASK                   0x000000FF
#define _GLCDCLUT118_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT118_GREEN_POSITION              0x00000008
#define _GLCDCLUT118_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT118_GREEN_LENGTH                0x00000008

#define _GLCDCLUT118_RED_POSITION                0x00000010
#define _GLCDCLUT118_RED_MASK                    0x00FF0000
#define _GLCDCLUT118_RED_LENGTH                  0x00000008

#define _GLCDCLUT119_BLUE_POSITION               0x00000000
#define _GLCDCLUT119_BLUE_MASK                   0x000000FF
#define _GLCDCLUT119_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT119_GREEN_POSITION              0x00000008
#define _GLCDCLUT119_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT119_GREEN_LENGTH                0x00000008

#define _GLCDCLUT119_RED_POSITION                0x00000010
#define _GLCDCLUT119_RED_MASK                    0x00FF0000
#define _GLCDCLUT119_RED_LENGTH                  0x00000008

#define _GLCDCLUT120_BLUE_POSITION               0x00000000
#define _GLCDCLUT120_BLUE_MASK                   0x000000FF
#define _GLCDCLUT120_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT120_GREEN_POSITION              0x00000008
#define _GLCDCLUT120_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT120_GREEN_LENGTH                0x00000008

#define _GLCDCLUT120_RED_POSITION                0x00000010
#define _GLCDCLUT120_RED_MASK                    0x00FF0000
#define _GLCDCLUT120_RED_LENGTH                  0x00000008

#define _GLCDCLUT121_BLUE_POSITION               0x00000000
#define _GLCDCLUT121_BLUE_MASK                   0x000000FF
#define _GLCDCLUT121_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT121_GREEN_POSITION              0x00000008
#define _GLCDCLUT121_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT121_GREEN_LENGTH                0x00000008

#define _GLCDCLUT121_RED_POSITION                0x00000010
#define _GLCDCLUT121_RED_MASK                    0x00FF0000
#define _GLCDCLUT121_RED_LENGTH                  0x00000008

#define _GLCDCLUT122_BLUE_POSITION               0x00000000
#define _GLCDCLUT122_BLUE_MASK                   0x000000FF
#define _GLCDCLUT122_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT122_GREEN_POSITION              0x00000008
#define _GLCDCLUT122_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT122_GREEN_LENGTH                0x00000008

#define _GLCDCLUT122_RED_POSITION                0x00000010
#define _GLCDCLUT122_RED_MASK                    0x00FF0000
#define _GLCDCLUT122_RED_LENGTH                  0x00000008

#define _GLCDCLUT123_BLUE_POSITION               0x00000000
#define _GLCDCLUT123_BLUE_MASK                   0x000000FF
#define _GLCDCLUT123_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT123_GREEN_POSITION              0x00000008
#define _GLCDCLUT123_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT123_GREEN_LENGTH                0x00000008

#define _GLCDCLUT123_RED_POSITION                0x00000010
#define _GLCDCLUT123_RED_MASK                    0x00FF0000
#define _GLCDCLUT123_RED_LENGTH                  0x00000008

